# task 7.
# Напишіть функцію, яка приймає 2 списки. Результатом має бути новий список,
# в якому знаходяться елементи першого списку, яких немає в другому. Порядок елементів,
# що залишилися має відповідати порядку в першому (оригінальному) списку. Реалізуйте обчислення за допомогою генератора.
#     Приклад:
#     array_diff([1, 2], [1]) --> [2]
#     array_diff([1, 2, 2, 2, 4, 3, 4], [2]) --> [1, 4, 3, 4]


def array_diff(lst_1: list, lst_2: list) -> list:
    return list(item for item in lst_1 if item not in lst_2)


if __name__ == '__main__':
    print('new array: ', array_diff([1, 2], [1]))  # --> [2]
    print('new array: ', array_diff([1, 2, 2, 2, 4, 3, 4], [2]))  # --> [1, 4, 3, 4]
